<template>
    <div class="container-fluid p-1 pt-5 pt-md-0 p-md-0 pt-md-5 p-lg-3 pt-lg-5">
        <h1>สาขาวิทยาการคอมพิวเตอร์</h1>
        <h3 class="text-black-50">มหาวิทยาลัยราชภัฏศรีสะเกษ</h3>
        <hr>
        <div class="m-auto row row-cols-1 row-cols-md-2 g-3">
            <div class="col row row-cols-1 g-2 mx-auto">
                <div class="col">
                    <b class="fs-5">#เกี่ยวกับหลักสูตร</b>
                    <br>
                    <div class="px-3 py-2">
                        <b>ชื่อสถาบันอุดมศึกษา </b>
                        <ul style="list-style: none;" class="px-3 py-2">
                            <li>มหาวิทยาลัยราชภัฏศรีสะเกษ</li>
                        </ul>
                    </div>
                    <div class="px-3 py-2">
                        <b>คณะ</b>
                        <ul style="list-style: none;" class="px-3 py-3">
                            <li> ศิลปศาสตร์และวิทยาศาสตร์ </li>
                        </ul>
                    </div>
                    <div class="px-3 py-2">
                        <b>ชื่อหลักสูตร</b>
                        <ul style="list-style: none;" class="px-3 py-3">
                            <li>
                                <b>ชื่อภาษาไทย</b>
                                <ul class="">
                                    <li class="my-2 mx-3">หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์</li>
                                </ul>
                            </li>
                            <li>
                                <b>ชื่อภาษาอังกฤษ</b>
                                <ul class="">
                                    <li class="my-2 mx-3">Bachelor of Science Program in Computer Science</li>
                                </ul>
                            </li>
                        </ul>
                    </div>
                    <div class="px-3 py-2">
                        <b>ชื่อปริญญาและสาขาวิชา</b>
                        <ul style="list-style: none;" class="px-3 py-3">
                            <li>
                                <b>ชื่อเต็มภาษาไทย</b>
                                <ul class="">
                                    <li class="my-2 mx-3">วิทยาศาสตรบัณฑิต (วิทยาการคอมพิวเตอร์)</li>
                                </ul>
                            </li>
                            <li>
                                <b>ชื่อเต็มอังกฤษ</b>
                                <ul class="">
                                    <li class="my-2 mx-3">Bachelor of Science (Computer Science)</li>
                                </ul>
                            </li>
                            <li>
                                <b>ชื่อย่อภาษาไทย</b>
                                <ul class="">
                                    <li class="my-2 mx-3">วท.บ. (วิทยาการคอมพิวเตอร์)</li>
                                </ul>
                            </li>
                            <li>
                                <b>ชื่อย่ออังกฤษ</b>
                                <ul class="">
                                    <li class="my-2 mx-3">B.Sc. (Computer Science)</li>
                                </ul>
                            </li>
                        </ul>
                    </div>
                    <div class="px-3 py-2">
                        <b>วิชาเอก</b>
                        <ul style="list-style: none;" class="px-3 py-3">
                            <li> วิทยาการคอมพิวเตอร์ </li>
                        </ul>
                    </div>
                    <div class="px-3 py-2">
                        <b>จำนวนหน่วยกิตที่เรียนตลอดหลักสูตร</b>
                        <ul style="list-style: none;" class="px-3 py-3">
                            <li> ไม่น้อยกว่า 134 หน่วยกิต </li>
                        </ul>
                    </div>
                    <div class="px-3 py-2">
                        <b>รูปแบบหลักสูตร</b>
                        <ul style="list-style: none;" class="px-3 py-3">
                            <li> หลักสูตรระดับปริญญาตรี 4 ปี</li>
                        </ul>
                    </div>
                </div>
            </div>
            <div class="col row row-cols-1 g-2 mx-auto">
                <div class="col">
                    <b class="fs-5">#ความสำคัญของหลักสูตร</b>
                    <ul style="list-style: none;">
                        <li class="p-3">
                            <p class="">
                                สาขาวิทยาการคอมพิวเตอร์เป็นสาขาวิชาที่ศึกษาเกี่ยวกับการออกแบบ พัฒนา และใช้งานระบบคอมพิวเตอร์
                                รวมถึงการศึกษาเกี่ยวกับซอฟต์แวร์ ฮาร์ดแวร์ การเขียนโปรแกรม การเชื่อมต่อเครือข่ายคอมพิวเตอร์
                                และการประยุกต์ใช้เทคโนโลยีสารสนเทศต่างๆ เพื่อแก้ไขปัญหาในชีวิตประจำวัน
                                หลักสูตรในสาขานี้จะให้ความรู้และทักษะที่จำเป็นสำหรับการทำงานในอุตสาหกรรมเทคโนโลยีสารสนเทศ
                                โดยในสาขาวิทยาการคอมพิวเตอร์นั้นมีหลายสาขาย่อยอื่นๆ เช่น วิทยาการข้อมูล
                                วิทยาการปัญญาประดิษฐ์
                                การเรียนรู้เชิงลึก
                                ความปลอดภัยสารสนเทศ ระบบฐานข้อมูล การจัดการโครงการ IT และอื่นๆ
                                ที่เกี่ยวข้องกับการนำเทคโนโลยีสารสนเทศไปใช้งานในอุตสาหกรรมต่างๆ
                                ดังนั้นการศึกษาในสาขาวิทยาการคอมพิวเตอร์จึงเป็นที่ต้องการของอุตสาหกรรมเทคโนโลยีสารสนเทศและการสื่อสารในยุคปัจจุบัน
                            </p>
                        </li>
                    </ul>
                </div>

                <div class="col">
                    <div>
                        <b class="fs-5">#ปรัชญาของหลักสูตร</b>
                        <ul style="list-style: none;">
                            <li class="p-3">
                                <p class="">
                                    เชี่ยวชาญด้านวิทยาการคอมพิวเตอร์ มีคุณธรรม นำวิจัยและพัฒนา
                                </p>
                            </li>
                        </ul>
                    </div>
                    <div>
                        <b class="fs-5">#สโลแกน</b>
                        <ul style="list-style: none;">
                            <li class="p-3">
                                <p class="">
                                    "Unleash the power of technology" สาขาวิทยาการคอมพิวเตอร์
                                    ช่วยเปิดเผยความสามารถของเทคโนโลยีให้กับคนทั่วไป
                                    และช่วยพัฒนาโลกใบนี้ให้ดียิ่งขึ้นด้วยการสร้างนวัตกรรมใหม่ๆ
                                </p>
                            </li>
                        </ul>
                    </div>
                </div>
                <div class="col-12">

                    <b class="fs-5">#วัตถุประสงค์ของหลักสูตร </b>
                    <p>เพื่อผลิตบัณฑิตให้มีคุณสมบัติด้านต่าง ๆ ดังนี้</p>
                    <ul class="">
                        <li class="">
                            <p class="">
                                มีความรู้และทักษะทางด้านวิทยาการคอมพิวเตอร์ การใช้และพัฒนาซอฟท์แวร์ เครือข่าย มัลติมีเดีย
                                ความปลอดภัยทางคอมพิวเตอร์
                                สามารถประยุกต์ใช้ทักษะทางด้านวิทยาการคอมพิวเตอร์ได้อย่างมีประสิทธิภาพและประสิทธิผลในการประกอบวิชาชีพ
                            </p>
                        </li>
                        <li class="">
                            <p class="">
                                สามารถประยุกต์ใช้ทักษะทางด้านวิทยาการคอมพิวเตอร์
                                การวิจัยทางวิทยาการคอมพิวเตอร์ได้อย่างมีประสิทธิภาพและประสิทธิผล
                                มีความรู้และทักษะพื้นฐานด้านวิทยาการคอมพิวเตอร์สำหรับการศึกษาต่อในระดับสูงขึ้นไป
                                รวมทั้งสามารถทำงานด้านธุรกิจคอมพิวเตอร์ได้
                            </p>
                        </li>
                        <li class="">
                            <p class="">
                                มีความใฝ่รู้และแสวงหาความรู้ด้วยตนเองอย่างต่อเนื่อง มีความคิดริเริ่มสร้างสรรค์
                                มีทักษะในการสื่อสารและสามารถทำงานร่วมกับผู้อื่นได้
                            </p>
                        </li>
                        <li class="">
                            <p class="">
                                มีคุณธรรม จริยธรรม รักษาจรรยาบรรณที่ดีต่อวิชาชีพ ทำหน้าที่เป็นพลเมืองดี รับผิดชอบต่อตนเอง
                                วิชาชีพและสังคมรวมทั้งมีลักษณะเป็นผู้นำและผู้ตามที่ดี
                            </p>
                        </li>
                    </ul>

                </div>
            </div>

        </div>
    </div>
</template>

<script>
import { defineComponent } from 'vue'

export default defineComponent(
    {
        name: "minimalDescription"
    }
);

</script>
<style>
li>p {
    color: rgba(0, 0, 0, 0.75);
}
</style>