<template>
    <div class="container-fluid p-1 pt-3 pt-md-0 p-md-0 pt-md-5 p-lg-3 pt-lg-5">
        <h2>เรียนกับเราแล้วดียังไง ?</h2>
        <hr>
        <div class="row m-auto g-2 row-cols-1 row-cols-sm-2  row-cols-lg-4">
            <!-- block 1 -->
            <div class="col">
                <h4>สามารถกู้ กยศ. ได้ 100%</h4>
                <p class="text-black-50">
                    เนื่องจากประเภทวิชาและสาขาที่เป็นความต้องการหลักและมีความชัดเจนของการผลิตกำลังคน สำหรับนิสิต
                    นักศึกษาที่เข้าร่วมโครงการ ปีการศึกษา 2560
                </p>
            </div>
            <!-- block 2 -->
            <div class="col">
                <h4>เรียนอยู่ที่บ้านเราเอง/ไกล้บ้าน</h4>
                <p class="text-black-50">
                    เรียนอยู่ที่บ้านเราเองหรือใกล้บ้านยังช่วยลดค่าใช้จ่ายในการเดินทางและเวลาในการเดินทางไป-กลับ
                    ทำให้เรามีเวลามากขึ้นสำหรับการเรียนรู้และพัฒนาตนเอง
                </p>
            </div>
            <!-- block 3 -->
            <div class="col">
                <h4>ไม่ตกเทรนด์ ข่าวสารเทคโนโลยี</h4>
                <p class="text-black-50">
                    ไม่พลาดทุกเทรนด์เทคโนโลยีสำคัญด้วยการติดตามข่าวสารและอัพเดตล่าสุดที่ได้รับความนิยมในปัจจุบัน
                    เพื่อให้คุณเข้าใจและติดตามได้อย่างสม่ำเสมอ
                </p>
            </div>
            <!-- block 4 -->
            <div class="col">
                <h4>งานที่มีอนาคตด้านเทคโนโลยีสูง</h4>
                <p class="text-black-50">
                    สาขาวิทยาการคอมพิวเตอร์เป็นสาขาวิชาที่มีอนาคตสูงในด้านเทคโนโลยี มีงานที่มากมายเชื่อมโยงกับเทคโนโลยี เช่น
                    การพัฒนาโปรแกรม, เว็บไซต์, การออกแบบฐานข้อมูล ฯลฯ
                </p>
            </div>

            <!-- block 5 -->
            <div class="col">
                <h4>จบแล้วมีงานทำแน่นอน</h4>
                <p class="text-black-50">
                    สายอาชีพเทคโนโลยีเป็นสายอาชีพที่กำลังเติบโตอย่างต่อเนื่อง
                    โดยเฉพาะในยุคปัจจุบันที่เทคโนโลยีมีบทบาทสำคัญในการพัฒนาธุรกิจและเศรษฐกิจให้ยั่งยืน
                </p>
            </div>

            <!-- block 6 -->
            <div class="col">
                <h4>รายได้ที่มั่นคง</h4>
                <p class="text-black-50">
                    นักศึกษาสาขาวิทยาการคอมพิวเตอร์มีโอกาสที่จะได้รับรายได้ที่มั่นคง และสูงกว่าสาขาอื่นๆ
                    มีงานที่ต้องการและตลาดงานที่กว้างขวาง
                </p>
            </div>
            <!-- block 7 -->
            <div class="col">
                <h4>ความหลากหลายของอาชีพ</h4>
                <p class="text-black-50">
                    สาขาวิทยาการคอมพิวเตอร์มีอาชีพที่หลากหลาย
                    ทำให้นักศึกษาสามารถเลือกที่จะทำงานในสายงานที่ตนเองชื่นชอบและมีความสนใจได้ เช่น นักพัฒนาซอฟต์แวร์,
                    นักวิเคราะห์ระบบ ฯลฯ
                </p>
            </div>
            <!-- block 8 -->
            <div class="col">
                <h4>มีความเป็นอิสระในการทำงาน</h4>
                <p class="text-black-50">
                    นักศึกษาสามารถทำงานอย่างเป็นอิสระ โดยไม่ต้องอยู่ในสถานที่ทำงานเดียวกันทุกวัน
                    สามารถทำงานได้จากที่ใดก็ได้ เช่น ทำงานที่บ้าน, ทำงานจากสถานที่อื่นๆที่มีอินเทอร์เน็ต
                </p>
            </div>
        </div>
    </div>
</template>
<script>

import { defineComponent } from 'vue'



export default defineComponent({
    name: "minimalStrength"
});


</script>